#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.hackday_rg will be created
  + resource "azurerm_resource_group" "hackday_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "hackday-jan-2023"
    }

  # azurerm_spring_cloud_app.hackday_springapp will be created
  + resource "azurerm_spring_cloud_app" "hackday_springapp" {
      + addon_json          = (known after apply)
      + fqdn                = (known after apply)
      + https_only          = false
      + id                  = (known after apply)
      + is_public           = false
      + name                = "wukir-springapp"
      + resource_group_name = "hackday-jan-2023"
      + service_name        = "wukir-springservice"
      + tls_enabled         = false
      + url                 = (known after apply)
    }

  # azurerm_spring_cloud_service.hackday_springservice will be created
  + resource "azurerm_spring_cloud_service" "hackday_springservice" {
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "wukir-springservice"
      + outbound_public_ip_addresses   = (known after apply)
      + required_network_traffic_rules = (known after apply)
      + resource_group_name            = "hackday-jan-2023"
      + service_registry_id            = (known after apply)
      + sku_name                       = "S0"
      + zone_redundant                 = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @castle-hack, Action: `pull_request`*